LIAO-ZI-JIE/STM32_quadcopter/Hardware/Serial.c
/******************** (C) COPYRIGHT 2014 ANO Tech ********************************
 * 作者    ：匿名科创
 * 文件名  ：data_transfer.c
 * 描述    ：数据传输
 * 官网    ：www.anotc.com
 * 淘宝    ：anotc.taobao.com
 * 技术Q群 ：190169595
 * 备注    ：移植匿名上位机通信协议文件，在此声明！
**********************************************************************************/

#include "stm32f10x.h"                  // Device header
#include <stdio.h>
#include <stdarg.h>
#include "Struct.h"
#include "Serial.h"
#include "LED.h"
#include "MPU9250.h"

uint8_t Serial_RxData;
uint8_t Serial_RxFlag;

void Serial_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);
	 
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_9 ;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;	 
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate=500000;//鮑率
	USART_InitStructure.USART_HardwareFlowControl=USART_HardwareFlowControl_None;//流控
	USART_InitStructure.USART_Mode=USART_Mode_Tx|USART_Mode_Rx ;//收發模式
	USART_InitStructure.USART_Parity=USART_Parity_No;//較驗位
	USART_InitStructure.USART_StopBits=USART_StopBits_1;//停止位
	USART_InitStructure.USART_WordLength=USART_WordLength_8b;//數據長度
	USART_Init(USART1,&USART_InitStructure);
	
	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);//中斷
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel=USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;
	NVIC_Init(&NVIC_InitStructure);
	
	USART_Cmd(USART1,ENABLE);
}
void Serial_SendByte(uint8_t Byte)
{
	USART_SendData(USART1,Byte);
	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)==RESET);
}

void Serial_SendArray(uint8_t *Array,uint16_t Length)
{
	uint16_t i;
	
	for(i=0;i<Length;i++)
	{
		Serial_SendByte(Array[i]);
	}
}
void Serial_SendString(char *String)
{
	uint8_t i;
	for(i=0;String[i] != '\0';i++)
	{
		Serial_SendByte(String[i]);
	}
}
uint32_t Pow(uint32_t X,uint32_t Y)
{
	uint32_t Result = 1;
	while (Y --)
	{
		Result *= X;
	}
	return Result;
}
void Serial_SendNum(uint32_t Number,uint8_t Length)
{
	uint8_t i;
	for(i=0;i<Length;i++)
	{
	Serial_SendByte(Number/Pow(10,Length-i-1)%10+'0');
	}
}
int fputc(int ch, FILE *f)
{
	Serial_SendByte(ch);
	return ch;
}

void Serial_Printf(char *format, ...)
{
	char String[100];
	va_list arg;
	va_start(arg, format);
	vsprintf(String, format, arg);
	va_end(arg);
	Serial_SendString(String);
}
uint8_t Serial_GetRxFlag(void)
{
	if (Serial_RxFlag == 1)
	{
		Serial_RxFlag = 0;
		return 1;
	}
	return 0;
}






//ANO的发送标志的数据结构
typedef struct FLAG_TYPE
{
	uint8_t send_version;
	uint8_t send_status;
	uint8_t send_senser;
	uint8_t send_rcdata;
	uint8_t send_motopwm;
	uint8_t send_power;
	uint8_t send_pid1;
	uint8_t send_pid2;
	uint8_t send_pid3;
	uint8_t send_pid4;
}FLAG_TYPE;


//数据拆分宏定义，在发送大于1字节的数据类型时，比如int16、float等，需要把数据拆分成单独字节进行发送
#define BYTE0(dwTemp)       ( *( (char *)(&dwTemp)		) )
#define BYTE1(dwTemp)       ( *( (char *)(&dwTemp) + 1) )
#define BYTE2(dwTemp)       ( *( (char *)(&dwTemp) + 2) )
#define BYTE3(dwTemp)       ( *( (char *)(&dwTemp) + 3) )
	
u8 flag = 0;
FLAG_TYPE f;				//需要发送数据的标志
uint8_t data_to_send[50];	//发送数据缓存


//Data_Exchange函数处理各种数据发送请求，比如想实现每5ms发送一次传感器数据至上位机，即在此函数内实现
void ANO_DT_Data_Exchange(void)
{
	
	static uint8_t status_cnt 	= 0;
	static uint8_t senser_cnt 	= 0;
	static uint8_t rcdata_cnt 	= 0;
	static uint8_t motopwm_cnt	= 0;
	static uint8_t power_cnt	= 0;
	status_cnt++;
	senser_cnt++;
	rcdata_cnt++;
	motopwm_cnt++;
	power_cnt++;
	if(status_cnt>=55)
	{
		status_cnt = 0;
		f.send_status = 1;
	}
	if(senser_cnt>=5)
	{
		senser_cnt = 0;
		f.send_senser = 1;
	}
	if(rcdata_cnt>=20)
	{
		rcdata_cnt = 0;
		f.send_rcdata = 1;
	}
	if(motopwm_cnt>=35)
	{
		motopwm_cnt = 0;
		f.send_motopwm = 1;
	}
	if(power_cnt>=60)
	{
		power_cnt = 0;
		f.send_power = 1;
	}

///////////////////////////////////////// 发送状态信息 ///////////////////////////////////////////
	if(f.send_status)
	{
		f.send_status = 0;
		ANO_DT_Send_Status(Attitude_Structure.Roll,Attitude_Structure.Pitch,Attitude_Structure.Yaw,0,0,1);
	}	
//////////////////////////////////////// 发送传感器信息 //////////////////////////////////////////
	else if(f.send_senser)
	{
		f.send_senser = 0;
		ANO_DT_Send_Senser(IMU_Structure.AccX,IMU_Structure.AccY,IMU_Structure.AccZ,
						   IMU_Structure.GyroX,IMU_Structure.GyroY,IMU_Structure.GyroZ,
						   IMU_Structure.MagX,IMU_Structure.MagY,IMU_Structure.MagZ,
						   0);
		Data_Send_AngleRate(Result_Structure.Acc.Y,Result_Structure.Acc.Z,Result_Structure.Gyro.X,Result_Structure.Gyro.Y,Result_Structure.Gyro.Z,Result_Structure.Mag.X,Result_Structure.Mag.Y,Result_Structure.Mag.Z);
		#if defined (ROL_PID_DEBUG)   //ROLL角调试
			Data_Send_AngleRate(Gyr_rad.X*RadtoDeg,PID_ROL_Rate.Pout,PID_ROL_Rate.Iout,PID_ROL_Rate.Dout,
		                       PID_ROL_Angle.Error,PID_ROL_Angle.Pout,PID_ROL_Angle.Iout,PID_ROL_Angle.Dout);
		
		#elif defined (PIT_PID_DEBUG) //PITCH角调试	
			Data_Send_AngleRate(Gyr_rad.Y*RadtoDeg,PID_PIT_Rate.Pout,PID_PIT_Rate.Iout,PID_PIT_Rate.Dout,
		                       PID_PIT_Angle.Error,PID_PIT_Angle.Pout,PID_PIT_Angle.Iout,PID_PIT_Angle.Dout);
		
		#elif defined (YAW_PID_DEBUG) //YAW角调试
			Data_Send_AngleRate(Gyr_rad.Z*RadtoDeg,PID_YAW_Rate.Pout,PID_YAW_Rate.Iout,PID_YAW_Rate.Dout,
													PID_YAW_Angle.Error,PID_YAW_Angle.Pout,PID_YAW_Angle.Iout,PID_YAW_Angle.Dout);
		
		#elif defined (ALT_PID_DEBUGE)//ALT环调试
			Data_Send_AngleRate(FBM.AltitudeFilter,PID_ALT.Error,PID_ALT.Pout,PID_ALT.Iout,PID_ALT.Dout,0,0,0);
		#endif
	}	 
/////////////////////////////////////////////////////////////////////////////////////
	else if(f.send_rcdata)
	{
		f.send_rcdata = 0;
//		ANO_DT_Send_RCData(Remote_Control_Structure.THROTTLE,Remote_Control_Structure.YAW,Remote_Control_Structure.ROLL,Remote_Control_Structure.PITCH,0,0,0,0,0,0);
	}	
/////////////////////////////////////////////////////////////////////////////////////	
	else if(f.send_motopwm)
	{
		f.send_motopwm = 0;
		//ANO_DT_Send_MotoPWM(Moto_PWM_1,Moto_PWM_2,Moto_PWM_3,Moto_PWM_4,5,6,7,8);
	}	
/////////////////////////////////////////////////////////////////////////////////////
	else if(f.send_power)
	{
		f.send_power = 0;
	}
/////////////////////////////////////////////////////////////////////////////////////
	else if(f.send_pid1)
	{
		f.send_pid1 = 0;
//		ANO_DT_Send_PID(1,PID_ROL_Rate.P,PID_ROL_Rate.I,PID_ROL_Rate.D,
//		                  PID_PIT_Rate.P,PID_PIT_Rate.I,PID_PIT_Rate.D,
//		                  PID_YAW_Rate.P,PID_YAW_Rate.I,PID_YAW_Rate.D);
		ANO_DT_Send_PID(1,0,1,32,
		                  0,1,32,
		                  0,1,32);

