LIAO-ZI-JIE/STM32_quadcopter/Hardware/Serial.c
	ANO_DT_Send_Data(data_to_send, _cnt);
}

/**************************************************** 自定义帧 **************************************************/
//角速度环调试,波形显示
void Data_Send_AngleRate(float data1,float data2,float data3,float data4,float data5,float data6,float data7,float data8)
{
	u8 _cnt=0,sum = 0,i;
	float _temp;
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0xF1; 
	data_to_send[_cnt++]=0;
	
	_temp = data1;//RadtoDeg
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = data2;
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = data3;
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = data4;
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = data5;
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = data6;
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = data7;
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = data8;
	data_to_send[_cnt++]=BYTE3(_temp);
	data_to_send[_cnt++]=BYTE2(_temp);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	

	data_to_send[3] = _cnt-4;

	for(i=0;i<_cnt;i++)
		sum += data_to_send[i];
		
	data_to_send[_cnt++] = sum;
	
	ANO_DT_Send_Data(data_to_send, _cnt);
}


////滤波效果观察函数调试
//void Data_Send_Filter(void)
//{
//	u8 _cnt=0,sum = 0,i;
//	float _temp;
//	vs16 temp;
//	data_to_send[_cnt++]=0xAA;
//	data_to_send[_cnt++]=0xAA;
//	data_to_send[_cnt++]=0xF2;
//	data_to_send[_cnt++]=0;

//	_temp = FBM.Altitude;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);
//	
//	_temp = nav.z;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);
//	
//	_temp = nav.vz;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);	
//   _temp = nav.az;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);	
//	_temp = Acc_filt.Z;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);


//	//_temp = Gyr_rad.X*RadtoDeg;
//	_temp =FBM.AltitudeFilter;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);	
//	//_temp = Gyr_rad.Y*RadtoDeg;
//	_temp = (float)MPU6050_ACC_RAW.Y*0.011964f;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);	
//	//_temp = Gyr_rad.Z*RadtoDeg;
//	_temp = (float)MPU6050_ACC_RAW.Z*0.011964f;
//	data_to_send[_cnt++]=BYTE3(_temp);
//	data_to_send[_cnt++]=BYTE2(_temp);
//	data_to_send[_cnt++]=BYTE1(_temp);
//	data_to_send[_cnt++]=BYTE0(_temp);

//	data_to_send[3] = _cnt-4;

//	for(i=0;i<_cnt;i++)
//		sum += data_to_send[i];
//		
//	data_to_send[_cnt++] = sum;
//	
//	ANO_DT_Send_Data(data_to_send, _cnt);
//}
/******************* (C) COPYRIGHT 2014 ANO TECH *****END OF FILE************/
\
void USART1_IRQHandler(void)
{
	if(USART_GetITStatus(USART1,USART_IT_RXNE)==SET	)
	{
		
		Serial_RxData=USART_ReceiveData(USART1);
		ANO_DT_Data_Receive_Prepare(Serial_RxData);
		Serial_RxFlag=1;
		USART_ClearITPendingBit(USART1, USART_IT_RXNE);	
	}
}

